app/controllers/api/projects_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."team_id" = $1  [["team_id", 1]]
---
  def index
    @projects = Project.where(team_id: current_user.team_id)

INSERT INTO "projects" ("title", "description", "author_id", "team_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "ui list 1"], ["description", ""], ["author_id", 1], ["team_id", 1], ["created_at", "2016-10-08 16:24:10.941508"], ["updated_at", "2016-10-08 16:24:10.941508"]]
---
  def create
    @project = Project.new(project_params)
    @project.author_id = current_user.id
    @project.team_id = current_user.team_id

    if @project.save

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 AND "projects"."id" = $2 LIMIT 1  [["id", 1], ["id", 0]]
---
  def show
    @project = current_user.projects.find(params[:id])