app/controllers/api/teams_controller.rb

SELECT "teams".* FROM "teams"
---
  def index
    @teams = Team.all