app/controllers/api/todos_controller.rb

INSERT INTO "todos" ("title", "description", "todoer_id", "project_id", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "mail invites"], ["description", ""], ["todoer_id", 4], ["project_id", 1], ["author_id", 1], ["created_at", "2016-10-08 20:59:47.237072"], ["updated_at", "2016-10-08 20:59:47.237072"]]
---
  def create
    @todo = Todo.new(todo_params)
    @todo.author_id = current_user.id

    if @todo.save

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "todos" SET "description" = $1, "done" = $2, "updated_at" = $3 WHERE "todos"."id" = $4  [["description", ""], ["done", "f"], ["updated_at", "2016-10-07 21:07:42.936650"], ["id", 6]]
---
  def update
    @todo = Todo.find(params[:id])
    if @todo.update(todo_params)