app/views/api/todos/_todo.json.jbuilder

INSERT INTO "todos" ("title", "description", "todoer_id", "project_id", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "mail invites"], ["description", ""], ["todoer_id", 4], ["project_id", 1], ["author_id", 1], ["created_at", "2016-10-08 20:59:47.237072"], ["updated_at", "2016-10-08 20:59:47.237072"]]
---
json.projectName todo.project.title
json.createdAt todo.created_at.strftime("%b %d")