app/views/api/projects/_project.json.jbuilder


if project.todos.first
---
SELECT "todos".* FROM "todos" WHERE "todos"."project_id" = $1  [["project_id", 3]]